In [14]:
import pandas as pd
import csv
pd.read_csv("data.csv")

     name  age           City
0    Ravi   24           Pune
1   Priya   32         Mumbai
2    Amit   29       Kolhapur
3    Neha   21         Sangli
4  Sanjay   35  Sambhajinagar

In [15]:
df=pd.read_csv("data.csv")
filtered_df=df[df.age>25]
print(filtered_df)

     name  age           City
1   Priya   32         Mumbai
2    Amit   29       Kolhapur
4  Sanjay   35  Sambhajinagar

In [13]:
df=pd.read_csv("data.csv")
df["City"]=["Pune","Mumbai","Kolhapur","Sangli","Sambhajinagar"]
df.to_csv("data.csv",index=0)

     name  age           City
0    Ravi   24           Pune
1   Priya   32         Mumbai
2    Amit   29       Kolhapur
3    Neha   21         Sangli
4  Sanjay   35  Sambhajinagar

In [27]:
df=pd.read_csv("data.csv")
filtered_df=df[df.age>25]

filtered_subset =filtered_df.loc[:,['name','City']]
filtered_subset

     name           City
1   Priya         Mumbai
2    Amit       Kolhapur
4  Sanjay  Sambhajinagar

In [30]:
df=pd.read_csv("data.csv")
df["age_group"]=df.age.apply([lambda i:"Senior" if i>50 else "Adult" if i>25 else "Teen"])
df.to_csv("data.csv",index=0)
df

     name  age           City age_group
0    Ravi   24           Pune      Teen
1   Priya   32         Mumbai     Adult
2    Amit   29       Kolhapur     Adult
3    Neha   21         Sangli      Teen
4  Sanjay   35  Sambhajinagar     Adult

In [31]:
df=pd.read_csv("data.csv")
df["age_group"]=df.age.apply([lambda i:"Senior" if i>50 else "Adult" if i>25 else "Teen"])
df.to_csv("filtered_output.csv",index=0)

In [32]:
%history -f Pandas_Mini_Practice.py